# -*- coding: utf-8 -*-
# -*- mode: org -*-
#+startup: beamer overview indent
#+LANGUAGE: pt-br
#+TAGS: noexport(n)
#+EXPORT_EXCLUDE_TAGS: noexport
#+EXPORT_SELECT_TAGS: export

#+Title: Algoritmos
#+Subtitle: *INF01202*
#+Author: Prof. Lucas Mello Schnorr
#+Date: \copyleft

#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [xcolor=dvipsnames]
#+OPTIONS: title:nil H:1 num:t toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+LATEX_HEADER: \input{org-babel.tex}

#+latex: \newcommand{\mytitle}{Strings ou Arranjos de Caracteres}
#+latex: \mytitleslide

* Configuração                                                     :noexport:

#+BEGIN_SRC emacs-lisp
(setq org-latex-listings 'minted
      org-latex-packages-alist '(("" "minted"))
      org-latex-pdf-process
      '("pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
        "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"))
(setq org-latex-minted-options
       '(("frame" "lines")
         ("fontsize" "\\scriptsize")))
#+END_SRC

#+RESULTS:
| frame    | lines       |
| fontsize | \scriptsize |
* Utilização de =printf= com /strings/

=a16-exemplo-printf.c=
#+attr_latex: :options fontsize=\normalsize
#+BEGIN_SRC C :tangle e/a16-exemplo-printf.c
#include <stdio.h>
int main () {
  char str0[15] = "Ana";
  char str1[15] = {'A', 'n', 'a' };
  char str2[] = "Maria";
  char str3[3] = "Joao";
  printf("->[%s]<-->[%s]<-->[%s]<-->[%s]<-\n",
	 str0, str1, str2, str3);
  return 0;
}
#+END_SRC

#+latex: \pause

Execução do exemplo

#+begin_src shell :results output :dir e :exports both
gcc a16-exemplo-printf.c -o a16-exemplo-printf
./a16-exemplo-printf
#+end_src

#+RESULTS:
: ->[Ana]<-->[Ana]<-->[Maria]<-->[JoaMaria]<-

* Vamos tentar mesmo assim

=a16-atribuir-strings.c=
#+BEGIN_SRC C :tangle e/a16-atribuir-strings.c
int main(){
  char str1[] = "Ana";
  char str2[15];
  str2 = str1;
  return 0;
}
#+END_SRC

#+latex: \pause

Compilar:

#+latex: {\small
#+begin_src shell :results output :dir e :exports both
gcc a16-atribuir-strings.c -o a16-atribuir-strings 2>&1 > x ; cat x
#+end_src

#+RESULTS:
: a16-atribuir-strings.c: In function ‘main’:
: a16-atribuir-strings.c:4:8: error: assignment to expression with array type
:    str2 = str1;
:         ^

#+latex: }

#+BEGIN_CENTER
Realmente não dá...

Mas como fazer para copiar uma string para outra, etc?
#+END_CENTER

